prusa3d/Prusa-Firmware-Buddy/lib/Middlewares/ST/STM32_USB_Host_Library/Class/MSC/Src/usbh_msc.c
  }
  return error;
}

/**
  * @brief  USBH_MSC_IsReady
  *         The function check if the MSC function is ready
  * @param  phost: Host handle
  * @retval USBH Status
  */
uint8_t  USBH_MSC_IsReady(USBH_HandleTypeDef *phost)
{
  MSC_HandleTypeDef *MSC_Handle = (MSC_HandleTypeDef *) phost->pActiveClass->pData;
  uint8_t res;

  if ((phost->gState == HOST_CLASS) && (MSC_Handle->state == MSC_IDLE))
  {
    res = 1U;
  }
  else
  {
    res = 0U;
  }

  return res;
}

/**
  * @brief  USBH_MSC_GetMaxLUN
  *         The function return the Max LUN supported
  * @param  phost: Host handle
  * @retval logical Unit Number supported
  */
uint8_t  USBH_MSC_GetMaxLUN(USBH_HandleTypeDef *phost)
{
  MSC_HandleTypeDef *MSC_Handle = (MSC_HandleTypeDef *) phost->pActiveClass->pData;

  if ((phost->gState == HOST_CLASS) && (MSC_Handle->state == MSC_IDLE))
  {
    return (uint8_t)MSC_Handle->max_lun;
  }

  return 0xFFU;
}

/**
  * @brief  USBH_MSC_UnitIsReady
  *         The function check whether a LUN is ready
  * @param  phost: Host handle
  * @param  lun: logical Unit Number
  * @retval Lun status (0: not ready / 1: ready)
  */
uint8_t  USBH_MSC_UnitIsReady(USBH_HandleTypeDef *phost, uint8_t lun)
{
  MSC_HandleTypeDef *MSC_Handle = (MSC_HandleTypeDef *) phost->pActiveClass->pData;
  uint8_t res;

  if ((phost->gState == HOST_CLASS) && (MSC_Handle->unit[lun].error == MSC_OK))
  {
    res = 1U;
  }
  else
  {
    res = 0U;
  }

  return res;
}

/**
  * @brief  USBH_MSC_GetLUNInfo
  *         The function return a LUN information
  * @param  phost: Host handle
  * @param  lun: logical Unit Number
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_MSC_GetLUNInfo(USBH_HandleTypeDef *phost, uint8_t lun, MSC_LUNTypeDef *info)
{
  MSC_HandleTypeDef *MSC_Handle = (MSC_HandleTypeDef *) phost->pActiveClass->pData;
  if (phost->gState == HOST_CLASS)
  {
    (void)USBH_memcpy(info, &MSC_Handle->unit[lun], sizeof(MSC_LUNTypeDef));
    return USBH_OK;
  }
  else
  {
    return USBH_FAIL;
  }
}

/**
 * @brief get_sof_counter
 *        Read OTG_HS host frame number (OTG_HS_HFNUM->FRNUM)
 * @param  phost: Host handle
*/
static uint16_t get_sof_counter(USBH_HandleTypeDef *phost) {
  HCD_HandleTypeDef *hhcd = (HCD_HandleTypeDef *)(phost->pData);
  USB_OTG_GlobalTypeDef *USBx = hhcd->Instance;
  return USB_GetCurrentFrame(USBx);
}

/**
  * @brief  USBH_MSC_Read
  *         The function performs a Read operation
  * @param  phost: Host handle
  * @param  lun: logical Unit Number
  * @param  address: sector address
  * @param  pbuf: pointer to data
  * @param  length: number of sector to read
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_MSC_Read(USBH_HandleTypeDef *phost,
                                 uint8_t lun,
                                 uint32_t address,
                                 uint8_t *pbuf,
                                 uint32_t length)
{
  MSC_HandleTypeDef *MSC_Handle = (MSC_HandleTypeDef *) phost->pActiveClass->pData;

  if ((phost->device.is_connected == 0U) ||
      (phost->gState != HOST_CLASS) ||
      (MSC_Handle->unit[lun].state != MSC_IDLE) ||
      (MSC_Handle->state != MSC_IDLE)
  ) {
    return  USBH_FAIL;
  }

  MSC_Handle->state = MSC_READ;
  MSC_Handle->unit[lun].state = MSC_READ;
  MSC_Handle->rw_lun = lun;

  (void)USBH_MSC_SCSI_Read(phost, lun, address, pbuf, length);

  uint32_t timeout = ticks_ms();
  uint16_t sof_counter = get_sof_counter(phost);
  uint32_t sof_counter_delta = 0;

  while (USBH_MSC_RdWrProcess(phost, lun) == USBH_BUSY)
  {
    if (USBH_LL_GetURBState(phost, MSC_Handle->OutPipe) != USBH_URB_DONE ||
        USBH_LL_GetURBState(phost, MSC_Handle->InPipe) != USBH_URB_DONE)
    {
      ulTaskNotifyTake(pdFALSE, 500 / portTICK_PERIOD_MS);
    }

    uint32_t elapsed_ticks = ticks_ms() - timeout;
    uint16_t elapsed_sof = get_sof_counter(phost) - sof_counter;
    // handle OTG_HS_HFNUM->FRNUM insufficient precision
    // the FRNUM register is only 16-bit, so after reaching half of its range, the beginning is
    // reset and the offset is increased, so that the measurement works even for intervals longer than 16s
    if (elapsed_sof > 8100) {
      sof_counter += 8000;
      sof_counter_delta += 8000;
    }
    // fail if the request takes longer than USBH_MSC_IO_TIMEOUT,
    // or immediately if SOF generation stops (this is behavior observed by logic analyzers directly on the bus,
    // it is an undocumented error condition that will be investigated further)
    if (phost->device.is_connected == 0U ||
        elapsed_ticks > (USBH_MSC_IO_TIMEOUT * length)) {
      MSC_Handle->state = MSC_IDLE;
      return USBH_FAIL;
    }
    if (!filesystem_semihosting_active() && (uint32_t)(elapsed_sof + sof_counter_delta + 3) < elapsed_ticks) {
      USBH_ErrLog("USB MSC operation read - missing SOF");
      MSC_Handle->state = MSC_IDLE;
      return USBH_FAIL;
    }
  }
  MSC_Handle->state = MSC_IDLE;

  return USBH_OK;
}

/**
  * @brief  USBH_MSC_Write
  *         The function performs a Write operation
  * @param  phost: Host handle
  * @param  lun: logical Unit Number
  * @param  address: sector address
  * @param  pbuf: pointer to data
  * @param  length: number of sector to write
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_MSC_Write(USBH_HandleTypeDef *phost,
                                  uint8_t lun,
                                  uint32_t address,
                                  uint8_t *pbuf,
                                  uint32_t length)
{
  MSC_HandleTypeDef *MSC_Handle = (MSC_HandleTypeDef *) phost->pActiveClass->pData;

  if ((phost->device.is_connected == 0U) ||
      (phost->gState != HOST_CLASS) ||
      (MSC_Handle->unit[lun].state != MSC_IDLE) ||
      (MSC_Handle->state != MSC_IDLE)
  ) {
    return  USBH_FAIL;
  }

  MSC_Handle->state = MSC_WRITE;
  MSC_Handle->unit[lun].state = MSC_WRITE;
  MSC_Handle->rw_lun = lun;

  (void)USBH_MSC_SCSI_Write(phost, lun, address, pbuf, length);

  uint32_t timeout = ticks_ms();
  uint16_t sof_counter = get_sof_counter(phost);
  uint32_t sof_counter_delta = 0;

