prusa3d/Prusa-Firmware-Buddy/lib/Middlewares/ST/STM32_USB_Host_Library/Class/MSC/Src/usbh_msc.c
  while (USBH_MSC_RdWrProcess(phost, lun) == USBH_BUSY)
  {
    if (USBH_LL_GetURBState(phost, MSC_Handle->OutPipe) != USBH_URB_DONE ||
        USBH_LL_GetURBState(phost, MSC_Handle->InPipe) != USBH_URB_DONE)
    {
      ulTaskNotifyTake(pdFALSE, 500 / portTICK_PERIOD_MS);
    }

    uint32_t elapsed_ticks = ticks_ms() - timeout;
    uint16_t elapsed_sof = get_sof_counter(phost) - sof_counter;
    // handle OTG_HS_HFNUM->FRNUM insufficient precision
    // the FRNUM register is only 16-bit, so after reaching half of its range, the beginning is
    // reset and the offset is increased, so that the measurement works even for intervals longer than 16s
    if (elapsed_sof > 8100) {
      sof_counter += 8000;
      sof_counter_delta += 8000;
    }
    // fail if the request takes longer than USBH_MSC_IO_TIMEOUT,
    // or immediately if SOF generation stops (this is behavior observed by logic analyzers directly on the bus,
    // it is an undocumented error condition that will be investigated further)
    if (phost->device.is_connected == 0U ||
        elapsed_ticks > (USBH_MSC_IO_TIMEOUT * length)) {
      MSC_Handle->state = MSC_IDLE;
      return USBH_FAIL;
    }
    if(!filesystem_semihosting_active() && (uint32_t)elapsed_sof + sof_counter_delta + 3 < elapsed_ticks) {
      USBH_ErrLog("USB MSC operation write - missing SOF");
      MSC_Handle->state = MSC_IDLE;
      return USBH_FAIL;
    }
  }
  MSC_Handle->state = MSC_IDLE;
  return USBH_OK;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
